ObjectStorage/src/Catalogs/ох_СервисныеАккаунтыОбъектныхХранилищ/ох_СервисныеАккаунтыОбъектныхХранилищ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ох_СервисныеАккаунтыОбъектныхХранилищ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАутентификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервис</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ObjectStorage/src/Catalogs/ох_СервисныеАккаунтыОбъектныхХранилищ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНастройкиСервисногоАккаунта(СервисныйАккаунт) Экспорт
	
	НастройкиСервисногоАккаунта = НовыйНастройкиСервисногоАккаунта();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Ссылка КАК СервисныйАккаунт,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Сервер КАК Сервер,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Регион КАК Регион,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.ЗащищенноеСоединение КАК ЗащищенноеСоединение,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.ТипАутентификации КАК ТипАутентификации,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Сервис КАК Сервис,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Использовать КАК Использовать,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Представление КАК Представление
	|ИЗ
	|	Справочник.ох_СервисныеАккаунтыОбъектныхХранилищ КАК ох_СервисныеАккаунтыОбъектныхХранилищ
	|ГДЕ
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Ссылка = &Ссылка
	|	И НЕ ох_СервисныеАккаунтыОбъектныхХранилищ.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Ссылка", СервисныйАккаунт);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НастройкиСервисногоАккаунта, Выборка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НастройкиСервисногоАккаунта.СервисныйАккаунт) Тогда
		
		Ключи = ох_ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			НастройкиСервисногоАккаунта.СервисныйАккаунт,
			"ИдентификаторКлюча, СекретныйКлюч");
		
		Если Ключи <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НастройкиСервисногоАккаунта, Ключи);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НастройкиСервисногоАккаунта;
	
КонецФункции

Функция НовыйНастройкиСервисногоАккаунта() Экспорт
	
	НастройкиСервисногоАккаунта = Новый Структура;
	НастройкиСервисногоАккаунта.Вставить(
		"СервисныйАккаунт", Справочники.ох_СервисныеАккаунтыОбъектныхХранилищ.ПустаяСсылка());
	НастройкиСервисногоАккаунта.Вставить("Сервер", "");
	НастройкиСервисногоАккаунта.Вставить("Регион", "");
	НастройкиСервисногоАккаунта.Вставить("ЗащищенноеСоединение", Истина);
	НастройкиСервисногоАккаунта.Вставить("ТипАутентификации", "");
	НастройкиСервисногоАккаунта.Вставить("Сервис", "");
	НастройкиСервисногоАккаунта.Вставить("ИдентификаторКлюча", "");
	НастройкиСервисногоАккаунта.Вставить("СекретныйКлюч", "");
	НастройкиСервисногоАккаунта.Вставить("Использовать", Истина);
	НастройкиСервисногоАккаунта.Вставить("Представление", "");
	
	Возврат НастройкиСервисногоАккаунта;
	
КонецФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
